nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso51u68/driver_examples/dmic/dmic_codec_direct/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 ,2021 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN                                               0x80u   /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1                                                    0x01u   /*!<@brief Selects pin function 1 */
#define IOCON_PIO_FUNC2                                                    0x02u   /*!<@brief Selects pin function 2 */
#define IOCON_PIO_FUNC4                                                    0x04u   /*!<@brief Selects pin function 4 */
#define IOCON_PIO_I2CDRIVE_HIGH                                          0x0200u   /*!<@brief High drive: 20 mA */
#define IOCON_PIO_I2CFILTER_DI                                           0x0400u   /*!<@brief I2C 50 ns glitch filter disabled */
#define IOCON_PIO_I2CSLEW_I2C                                              0x00u   /*!<@brief I2C mode */
#define IOCON_PIO_INPFILT_OFF                                            0x0100u   /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI                                                   0x00u   /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT                                               0x00u   /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP                                              0x10u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI                                             0x00u   /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD                                            0x00u   /*!<@brief Standard mode, output slew rate control is enabled */
#define PIO031_FILTEROFF_DISABLED                                          0x01u   /*!<@brief Controls input glitch filter.: Filter disabled. No input filtering is done. */
#define PIO031_INVERT_DISABLED                                             0x00u   /*!<@brief Input polarity.: Disabled. Input function is not inverted. */
#define PIO031_MODE_PULL_UP                                                0x02u   /*!<@brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO031_OD_NORMAL                                                   0x00u   /*!<@brief Controls open-drain mode.: Normal. Normal push-pull output */
#define PIO10_FILTEROFF_DISABLED                                           0x01u   /*!<@brief Controls input glitch filter.: Filter disabled. No input filtering is done. */
#define PIO10_INVERT_DISABLED                                              0x00u   /*!<@brief Input polarity.: Disabled. Input function is not inverted. */
#define PIO10_MODE_PULL_UP                                                 0x02u   /*!<@brief Selects function mode (on-chip pull-up/pull-down resistor control).: Pull-up. Pull-up resistor enabled. */
#define PIO10_OD_NORMAL                                                    0x00u   /*!<@brief Controls open-drain mode.: Normal. Normal push-pull output */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
